src/app/controllers/items_controller.rb

UPDATE "items" SET "updated_at" = $1 WHERE "items"."id" = $2  [["updated_at", "2019-11-06 23:45:18.913428"], ["id", 26]]
---
  def update
    if @item.update(item_params)