src/app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 4]]
---
  def user_index
    @items = Item.where(user: current_user)

INSERT INTO "items" ("user_id", "description", "price", "condition", "gender", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @item = Item.new(item_params)
    @item.image.attach(item_params[:image])
    @item.user = current_user
    if @item.save

UPDATE "items" SET "size" = $1, "condition" = $2, "gender" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["size", "0000"], ["condition", "Fair"], ["gender", "Male"], ["updated_at", "2019-11-05 00:35:11.550095"], ["id", 7]]
---
  def update
    if @item.update(item_params)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def fetch_item
    @item = Item.find(params[:id])