src/app/controllers/orders_controller.rb

  def new
    @item = Item.find(params[:item_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]